In [1]:
import numpy as np
import pandas as pd
import matplotlib as plt

In [2]:
df=pd.read_csv('Countries_exercise.csv' )
df['name']

0             Aruba
1       Afghanistan
2            Angola
3          Anguilla
4           Albania
           ...
236           Samoa
237           Yemen
238    South Africa
239          Zambia
240        Zimbabwe
Name: name, Length: 241, dtype: object

#encoding='cp1225 if data encoded

In [3]:
usecols=['name']
df.usecols=['name']
df

c:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access

             name   Longitude   Latitude
0           Aruba  -69.982677  12.520880
1     Afghanistan   66.004734  33.835231
2          Angola   17.537368 -12.293361
3        Anguilla  -63.064989  18.223959
4         Albania   20.049834  41.142450
..            ...         ...        ...
236         Samoa -172.164851 -13.753243
237         Yemen   47.586762  15.909280
238  South Africa   25.083901 -29.000341
239        Zambia   27.774759 -13.458242
240      Zimbabwe   29.851441 -19.004204

[241 rows x 3 columns]

In [4]:
#pdf data use with tabula function

In [5]:
###save data

In [6]:
obj =pd.Series([1,2,3,4,5])
obj

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [7]:
obj.index

RangeIndex(start=0, stop=5, step=1)

In [8]:
obj.values

array([1, 2, 3, 4, 5], dtype=int64)

In [9]:
#we can replace index,values in series

In [10]:
obj1=pd.Series([1,2,3,4],index=['a','b','c','d'])

In [11]:
print(obj,obj1)
obj+obj1

0    1
1    2
2    3
3    4
4    5
dtype: int64 a    1
b    2
c    3
d    4
dtype: int64

0   NaN
1   NaN
2   NaN
3   NaN
4   NaN
a   NaN
b   NaN
c   NaN
d   NaN
dtype: float64

In [12]:
#axis top to bottom 0.axis
#left to right 1.axis

In [13]:

s1=pd.Series([1,2,3,4])#list
#tupe
s2=pd.Series((1,2,3,4),index=['a','b','c','d'],name='CNIC')
s2.index.name='id'

print(s1,s2, sep='/n')

0    1
1    2
2    3
3    4
dtype: int64/nid
a    1
b    2
c    3
d    4
Name: CNIC, dtype: int64

In [14]:
di={'a:1',
   'b:2'}
s3=pd.Series(di)
s3

TypeError: 'set' type is unordered

In [18]:
data=[1,'abbrar,'ai,15000]

SyntaxError: invalid syntax (<ipython-input-18-635767791761>, line 1)

In [15]:
data=pd.DataFrame(df)

In [16]:
data

             name   Longitude   Latitude
0           Aruba  -69.982677  12.520880
1     Afghanistan   66.004734  33.835231
2          Angola   17.537368 -12.293361
3        Anguilla  -63.064989  18.223959
4         Albania   20.049834  41.142450
..            ...         ...        ...
236         Samoa -172.164851 -13.753243
237         Yemen   47.586762  15.909280
238  South Africa   25.083901 -29.000341
239        Zambia   27.774759 -13.458242
240      Zimbabwe   29.851441 -19.004204

[241 rows x 3 columns]

In [22]:
df1=pd.DataFrame(data,columns=['name','longitude','latitude']),index=range(1,-1)
df1

SyntaxError: can't assign to function call (<ipython-input-22-6ab7da3377f1>, line 1)

# create data frame through numpy

In [23]:
df1= pd.DataFrame(
np.random.randint(1,100,size=(100,5)))
df1

     0   1   2   3   4
0   33  21  22   4  71
1   82  29  20  53  15
2   20  32  65  84  99
3   51  90  56   3  86
4    8  19  42  63  27
..  ..  ..  ..  ..  ..
95  23  53  31  32  31
96  12  19  63  95  61
97  56  74  76  35  80
98  14  52  74  68  61
99   9  93  87  43  57

[100 rows x 5 columns]

In [24]:
df.info

<bound method DataFrame.info of              name   Longitude   Latitude
0           Aruba  -69.982677  12.520880
1     Afghanistan   66.004734  33.835231
2          Angola   17.537368 -12.293361
3        Anguilla  -63.064989  18.223959
4         Albania   20.049834  41.142450
..            ...         ...        ...
236         Samoa -172.164851 -13.753243
237         Yemen   47.586762  15.909280
238  South Africa   25.083901 -29.000341
239        Zambia   27.774759 -13.458242
240      Zimbabwe   29.851441 -19.004204

[241 rows x 3 columns]>

In [26]:
df.describe

<bound method NDFrame.describe of              name   Longitude   Latitude
0           Aruba  -69.982677  12.520880
1     Afghanistan   66.004734  33.835231
2          Angola   17.537368 -12.293361
3        Anguilla  -63.064989  18.223959
4         Albania   20.049834  41.142450
..            ...         ...        ...
236         Samoa -172.164851 -13.753243
237         Yemen   47.586762  15.909280
238  South Africa   25.083901 -29.000341
239        Zambia   27.774759 -13.458242
240      Zimbabwe   29.851441 -19.004204

[241 rows x 3 columns]>

In [30]:
df.isnull().sum()

name         0
Longitude    0
Latitude     0
dtype: int64

In [32]:
df.notnull().sum()

name         241
Longitude    241
Latitude     241
dtype: int64

In [36]:
df.dtypes

name          object
Longitude    float64
Latitude     float64
dtype: object

In [37]:
df.describe()

        Longitude    Latitude
count  241.000000  241.000000
mean    14.215380   17.169377
std     72.013654   26.554014
min   -177.348348  -80.508579
25%    -36.433184    1.358761
50%     18.644925   17.277500
75%     47.587005   39.115541
max    171.484924   74.710513

df.name

In [43]:
df['updated fee']=np.random.randn()
df

             name   Longitude   Latitude  updated fee
0           Aruba  -69.982677  12.520880    -0.299316
1     Afghanistan   66.004734  33.835231    -0.299316
2          Angola   17.537368 -12.293361    -0.299316
3        Anguilla  -63.064989  18.223959    -0.299316
4         Albania   20.049834  41.142450    -0.299316
..            ...         ...        ...          ...
236         Samoa -172.164851 -13.753243    -0.299316
237         Yemen   47.586762  15.909280    -0.299316
238  South Africa   25.083901 -29.000341    -0.299316
239        Zambia   27.774759 -13.458242    -0.299316
240      Zimbabwe   29.851441 -19.004204    -0.299316

[241 rows x 4 columns]